IDOK                                          = "확인"
IDCANCEL                                      = "취소"
IDAPPLY                                       = "적용"
IDCLOSE                                       = "닫기"
IDDEFAULT                                     = "기본값"

ID_ADD                                        = "추가"
ID_DELETE                                     = "삭제"
ID_INSERT                                     = "삽입"

ID_SEISMIC_FRAME_TYPE_SMF                     = "SMF"
ID_SEISMIC_FRAME_TYPE_IMF                     = "IMF"
ID_SEISMIC_FRAME_TYPE_OMF                     = "OMF"
ID_SEISMIC_FRAME_TYPE_DES                     = "DES"
ID_SEISMIC_FRAME_TYPE_DMO                     = "DMO"
ID_SEISMIC_FRAME_TYPE_DMI                     = "DMI"
ID_SEISMIC_WALL_TYPE_SMF                      = "특수 전단벽"
ID_SEISMIC_WALL_TYPE_IMF                      = "중간 전단벽"
ID_SEISMIC_WALL_TYPE_OMF                      = "보통 전단벽"

IDC_COMPRESSION_REBAR                         = "유형"
IDC_DO_NOT_CONSIDER                           = "단근보"
IDC_CONSIDER                                  = "복근보"

IDC_DPLUS_INP_BTN_APPLY                       = "적용"
IDC_DPLUS_INP_BTN_CHECK                       = "검토"
IDC_DPLUS_INP_BTN_DESIGN                      = "설계"
IDC_DPLUS_INP_BTN_REPORT                      = "계산서 ..."
IDC_DPLUS_INP_BTN_PRINT                       = "인쇄 ..."
IDC_DPLUS_INP_BTN_SAVE                        = "저장 ..."

IDC_DPLUS_INP_BTN_SEL_ALL                     = "전체"
IDC_DPLUS_INP_BTN_SEL_NONE                    = "해제"
IDC_DPLUS_INP_BTN_SEL_INVERT                  = "반전"
IDC_DPLUS_INP_BTN_EXCEL_FILE                  = "엑셀 파일 ..."
IDC_DPLUS_INP_BTN_AUTORESIZE                  = "열 크기 조정"
IDS_SELECT_MEMBER                             = "부재를 선택하세요."
IDS_IMPORT_SECTION                            = "단면정보 가져오기"

IDC_DGN_BTN_EVAL_MEMB                         = "부재 평가"
IDC_DGN_BTN_EVAL_TOTL                         = "건물 평가 ..."
IDC_DGN_BTN_EXCEL_OUT                         = "엑셀 파일 ..."
IDC_DGN_BTN_AUTO_SIZE                         = "자동 열크기 조정"

IDC_DPLUS_LABEL_MEMB_NAME                     = "부재 이름"
IDC_DPLUS_FRAME_GENERAL                       = "일반 사항"
IDC_DPLUS_LABEL_USE_TYPE                      = "부재 적용 유형"

IDS_DOUBLE_CLICK_TO_ZOOM                      = "더블 클릭으로 확대"
IDS_DOUBLE_CLICK_TO_CLOSE                     = "더블 클릭으로 닫기"

IDS_MOMENT                                    = "모멘트"
IDS_SHEAR                                     = "전단"
IDS_BENDING_MOMENT                            = "휨모멘트"
IDS_SHEAR_FORCE                               = "전단력"
IDS_MATERIAL                                  = "재질"
IDS_SECTION                                   = "단면"
IDS_STUD                                      = "스터드"
IDS_STUD_BOLT                                 = "스터드 볼트"
IDS_RIB                                       = "리브"
IDS_RIB_PLATE                                 = "리브 플레이트"

/////// IDD_MAIN_LCOM_DLG
IDD_MAIN_LCOM_DLG                             = "하중 조합 정보"
IDC_MAIN_LCOM_FRAME                           = "부재 선택"
IDC_MAIN_LCOM_SYNC_CHK                        = "주 프로그램과 연동"
IDC_MAIN_LCOM_SYSTEM_STC                      = "재료"
IDC_MAIN_LCOM_MEMBER_STC                      = "유형"
IDC_MAIN_LCOM_ELEM_STC                        = "부재"
IDC_MAIN_LCOM_SYNC_LBL                        = "(체크해제 : 현재 상태 유지)"
IDC_MAIN_LCOM_LBL_OPACITY                     = "투명도"

/////// IDD_MAIN_DRAW_DLG
IDC_DWG_LIST_BTN_CREATE                       = "생성"
IDC_DWG_LIST_BTN_SAVE                         = "저장..."
IDC_DWG_LIST_BTN_BLOCKPRINT                   = "블록프린트"

/////// IDD_MAIN_WORKTREE_DOCK_PAGE
IDC_MAIN_ADD_MEMB_GROUP                       = "부재 추가"
IDC_MAIN_LIST_SYSTEM_STC                      = "재질별"
IDC_MAIN_LIST_MEMBER_STC                      = "유형별"
IDC_MAIN_LIST_NAME_STC                        = "부재명"
IDC_MAIN_LIST_ADD_BUTTON                      = "부재 추가"
IDC_MAIN_LIST_ADD_IMPORT                      = "가져오기"
IDC_MAIN_LIST_IMPORT_GNX                      = "GEN NX 데이터 가져오기"
IDC_MAIN_LIST_IMPORT_GEN                      = "Gen 데이터 가져오기"
IDC_MAIN_LIST_IMPORT_ADS                      = "ADS 데이터 가져오기"
IDC_MAIN_LIST_EXP_BUTTON                      = "내보내기"
IDC_MAIN_LIST_OPT_BUTTON                      = "옵션 ..."
IDC_MAIN_LIST_ELEM_STC                        = "부재번호"
IDC_MAIN_LIST_NODE_STC                        = "절점번호"
IDC_MAIN_LIST_NOTE_BEAM                       = "모든 보 정보가 연동됩니다."
IDC_MAIN_LIST_NOTE_COLM                       = "모든 기둥 정보가 연동됩니다."
IDC_MAIN_LIST_NOTE_WALL                       = "모든 벽체 정보가 연동됩니다."
IDC_MAIN_LIST_CHK_KEEP                        = "단면 및 배근 정보 유지"
IDC_MAIN_LIST_DEL_BATCH_BEAM                  = "기존의 일괄 보 데이터가 삭제됩니다.\n\n계속 진행할까요?"
IDC_MAIN_LIST_DEL_BATCH_COLM                  = "기존의 일괄 기둥 데이터가 삭제됩니다.\n\n계속 진행할까요?"
IDC_MAIN_LIST_DEL_BATCH_WALL                  = "기존의 일괄 전단벽 데이터가 삭제됩니다.\n\n계속 진행할까요?"

/////// IDD_MAIN_PROTECTION_EX_OPT_KR_DLG
IDC_STATIC_COMMENT                            = " 원하는 프로그램 옵션을 선택하세요."
IDC_PRODUCT_OPTION_STC                        = "옵션 "
IDC_OPTION_SELECT_ALL                         = "전체선택"
IDC_OPTION_SELECT_NONE                        = "선택해제"
IDC_LBC_LOCKOPT_UPDATEBTN                     = "옵션갱신"
IDC_LBC_LOCKOPT_KR_CHK1                       = "알루미늄"
IDC_LBC_LOCKOPT_KR_CHK2                       = "파형웨브보"
IDC_LBC_LOCKOPT_KR_CHK3                       = "정보 내보내기 ( Gen )"

/////// IDD_MAIN_PROTECTION_EX_OPT_US_DLG
IDC_LBC_LOCKOPT_US_CHK1                       = "US기준제외"
IDC_LBC_LOCKOPT_US_CHK2                       = "유로코드"
IDC_LBC_LOCKOPT_US_CHK3                       = "인도코드"
IDC_LBC_LOCKOPT_US_CHK4                       = "한국코드"
IDC_LBC_LOCKOPT_US_CHK5                       = "알루미늄코드"
IDC_LBC_LOCKOPT_US_CHK6                       = "일괄설계"

/////// IDD_MAIN_PROTECTION_EX_OPT_CH_DLG
IDC_LBC_LOCKOPT_CH_CHK1                       = "US 기준"
IDC_LBC_LOCKOPT_CH_CHK2                       = "유로코드"
IDC_LBC_LOCKOPT_CH_CHK3                       = "기타 코드"
IDC_LBC_LOCKOPT_CH_CHK4                       = "일괄설계"

/////// IDD_MAIN_PROTECTION_EX_DLG
IDD_MAIN_PROTECTION_EX_DLG                    = "프로텍션 라이센스 등록"
IDC_MAIN_RD1                                  = "웹 인증"
IDC_MAIN_RD3                                  = "기타 인증"
IDC_MAIN_RD4                                  = "Period Lock"
IDC_MAIN_REG_FRM_LICENSE                      = "프로그램 사용 인증"
IDC_MAIN_STATIC_1                             = "사용자 ID"
IDC_MAIN_STATIC_2                             = "암호"
IDC_MAIN_STATIC_US_PK                         = "Protection Key ID"
IDC_MAIN_PROXY_SERVER_CHK                     = "프록시 서버 사용"
IDC_MAIN_PROTECT_OPTBTN                       = "제품 선택"
IDC_MAIN_PROTECT_MEMBERSHIP_BTN               = "새로운 계정 생성"
IDC_MAIN_STATIC_KEYNUMBER                     = "키 번호 "
IDC_MAIN_STATIC_KEYTYPE                       = "키 유형 "
IDC_MAIN_STATIC_PROTOCOL                      = "Protocol "
IDC_MAIN_SERVER_NAME_CHK                      = "서버 이름 또는 IP 주소"
IDC_MAIN_STATIC_3                             = "인증 유형"
IDC_MAIN_RD2                                  = "소프트웨어 락인증"
IDC_MAIN_STATIC_COMMENT                       = " MUSS 인증"
IDC_MAIN_STATIC_4                             = "키 번호"
IDC_MAIN_SWL_HARDWAREID_BT                    = "하드웨어 ID"
IDC_MAIN_SWL_FIXCLOCK_BT                      = "시계 문제 수정"
IDC_MAIN_STATIC_MODS1                         = "MIDAS On Demand Service"
IDC_MAIN_STATIC_MODS2                         = "Welcome to"
IDC_MAIN_STATIC_MODS3                         = "[ Design+ Ver.100 ]"
IDC_MAIN_CHK_STARTUP                          = "시작시에 이 대화상자 보이지 않음."
IDC_MAIN_REG_RESET_BTN                        = "초기화"
IDC_MAIN_PERIOD_KEY_NUM_STC                   = "키 번호"
IDC_MAIN_PERIOD_HARD_ID_BTN					  = "하드웨어 ID"

/////// IDD_MAIN_PROXY_SERVER_DLG
IDC_MAIN_PROXY_SERVER_FRM                     = "프록시 서버 설정"
IDC_RDO_AUTO_DETECT                           = "자동 설정"
IDC_RDO_MANUAL_SET                            = "사용자 설정"
IDC_MAIN_PROXY_ADDRESS_STC                    = "프록시 서버 주소 ( 예: Proxy.midasit.com 또는 IP 주소 )와 포트"
IDC_MAIN_PROXY_ADDRESS_STC2                   = "주소 :"
IDC_MAIN_PROXY_PORT_STC                       = "포트 :"
IDC_MAIN_PROXY_USER_INFO_CHK                  = "프록시 서버 접근을 위해 사용자명과 암호 필요."
IDC_MAIN_PROXY_USERNAME_STC                   = "사용자명 :"
IDC_MAIN_PROXY_PASSWORD_STC                   = "암호 :"

/////// IDD_MAIN_PERIOD_HARDWAREID
IDD_MAIN_PERIOD_HARDWAREID                    = "하드웨어 ID"

/////// IDD_MAIN_REORDER_MEMBER_LIST_DLG
IDD_MAIN_REORDER_MEMBER_LIST_DLG              = "부재 목록 재정렬"
IDC_MAIN_LIST_MEMBER_FRM                      = "부재 선택"
IDC_MAIN_LIST_MEMB_LIST_FRM                   = "부재 목록"
IDC_MAIN_REORDER_SORT_BTN                     = "정렬"
IDC_MAIN_LIST_MEMB_SORT_FRM                   = "정렬된 부재 목록"
IDC_MAIN_REORDER_UP_BTN                       = "위로"
IDC_MAIN_REORDER_DN_BTN                       = "아래로"
IDC_MAIN_REORDER_APPLY_BTN                    = "적용"

/////// IDD_MAIN_WORKTREE_GROUP
IDD_MAIN_WORKTREE_GROUP                       = "부재 목록 그룹핑"
IDC_GROUP_ADD_BTN                             = "신규"
IDC_GROUP_CPY_BTN                             = "복사"
IDC_GROUP_MOD_BTN                             = "변경"
IDC_GROUP_DEL_BTN                             = "삭제"
IDC_GROUP_UP_BTN                              = "위로"
IDC_GROUP_DOW_BTN                             = "아래로"
IDC_GROUP_GR_ALL_BTN                          = "전체선택"
IDC_GROUP_GR_NON_BTN                          = "선택해제"
IDC_GROUP_GR_IVT_BTN                          = "선택반전"
IDC_GROUP_DB_ALL_BTN                          = "전체선택"
IDC_GROUP_DB_NON_BTN                          = "선택해제"
IDC_GROUP_DB_IVT_BTN                          = "선택반전"
IDC_GROUP_FRM_GROUP_LIST                      = "그룹 목록"
IDC_GROUP_FRM_MEMB_GROUP                      = "그룹에 포함된 부재"
IDC_GROUP_FRM_MEMB_DB                         = "그룹에 포함되지 않은 부재"
IDC_GROUP_FRM_PROPERTY                        = "그룹 속성"
IDC_GROUP_LBL_PROP_NAME                       = "이름"
IDC_GROUP_LBL_PROP_APPLY                      = "적용범위"
IDC_GROUP_LBL_PROP_DESC                       = "설명"
IDC_GROUP_DB_CHK_NONGROUPONLY                 = "비그룹 부재만 보기"

/////// IDD_MAIN_STR_CONVERT_DLG
IDD_MAIN_STR_CONVERT_DLG                      = "문자열 변환기 ( ini 파일 생성기 )"
IDC_STR_CONVERT_FRM_FLDR                      = "파일 폴더 선택"
IDC_STR_CONVERT_LBL_FLDH                      = ".h 파일"
IDC_STR_CONVERT_LBL_FLDI                      = ".ini 파일"
IDC_STR_CONVERT_FRM_OPTN                      = "변환 옵션"
IDC_STR_CONVERT_CHK_AUTOTAB                   = "탭 위치 자동 결정"
IDC_STR_CONVERT_LBL_TABS                      = "정렬 위치 ( 탭 지정 )"
IDC_STR_CONVERT_CHK_BLANK                     = "빈줄 삭제하기"
IDC_STR_CONVERT_CHK_CMMNT                     = "주석 삭제하기"
IDC_STR_CONVERT_BTN_CNVRT                     = "문자열 변환하기"

/////// IDD_MAIN_STR_ALIGN_DLG
IDD_MAIN_STR_ALIGN_DLG                        = "문자열 정렬기"
IDC_STR_ALIGN_FRM_FLDR                        = "ini 파일 폴더 설정"
IDC_STR_ALIGN_LBL_FLDB                        = "정렬 전"
IDC_STR_ALIGN_LBL_FLDA                        = "정렬 후"
IDC_STR_ALIGN_FRM_OPTN                        = "정렬 옵션"
IDC_STR_ALIGN_CHK_AUTOTAB                     = "탭 위치 자동 결정"
IDC_STR_ALIGN_LBL_TABS                        = "정렬 위치 ( 탭 지정 )"
IDC_STR_ALIGN_CHK_BLANK                       = "빈줄 삭제하기"
IDC_STR_ALIGN_CHK_CMMNT                       = "주석 삭제하기"
IDC_STR_ALIGN_BTN_ALIGN                       = "문자열 정렬하기"

/////// IDD_MAIN_STR_COPY_DLG
IDD_MAIN_STR_COPY_DLG                         = "Design Engine 문자열 파일 복사"
IDC_STR_COPY_FRM_FLDR                         = "파일 폴더"
IDC_STR_COPY_LBL_FLD_FR                       = "Design Engine 소스 위치"
IDC_STR_COPY_LBL_FLD_TO                       = "문자열 파일 복사 위치"
IDC_STR_COPY_FRM_LANG                         = "언어별 접미어"
IDC_STR_COPY_LBL_LANG_EN                      = "영어"
IDC_STR_COPY_LBL_LANG_KR                      = "한국어"
IDC_STR_COPY_LBL_LANG_CH                      = "중국어"
IDC_STR_COPY_LBL_LANG_JP                      = "일본어"
IDC_STR_COPY_LBL_LANG_RU                      = "러시아어"
IDC_STR_COPY_LBL_LANG_TW                      = "대만어"
IDC_STR_COPY_BTN_COPY                         = "파일 복사"
